tests/performance/artillery.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 30 # duração reduzida para teste completo
      arrivalRate: 30 # usuários por segundo (reduzido para fluxo completo)
scenarios:
  - name: fluxo-completo-sistema
    flow:
      # 1. LOGIN
      - post:
          url: /auth/login
          json:
            username: Administrador
            password: admin123

      # Pausa entre requisições
      - think: 1